app/controllers/turnovers_controller.rb

SELECT "turnovers".* FROM "turnovers" WHERE ("turnovers"."created_at" BETWEEN '2019-06-03 16:00:00.000000' AND '2019-06-04 15:59:59.999999')
---
    def show
       WebCrawler.update_new_stocks_turnover_data_to_db
       @turnovers = Turnover.all